04_Simulation/PH_2D_RANS_kOmegaSSTx_EVE-MO-57/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("./lib/kOmegaSSTx.so");
//libs ("kOmegaSSTx_OF8.so");

application     simpleFoam;

startFrom       startTime;

startTime       20000;

stopAt          endTime;

endTime         40000;

deltaT          1;

writeControl    timeStep;

writeInterval   20000;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;


// ************************************************************************* //
