04_Simulation/PH_2D_RANS_kOmegaSSTx_EVE-MO-57/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
0.024021779
0.072066783
0.1201037
0.16806508
0.21575978
0.26282663
0.30874267
0.3530037
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.0225
0.0675
0.1125
0.1575
0.2025
0.2475
0.2925
0.3375
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.024022463
0.072067475
0.12010235
0.16805969
0.21574845
0.2628078
0.30871541
0.35296851
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
